trade_exp/src/Documents/КонтрольДенежныхСредств/КонтрольДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9ad5dd4e-f9fd-4cde-a975-66968fae272f">
  <name>КонтрольДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="122d941f-9df2-4047-bfb1-67792592a114">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cf66aa90-38cd-4743-b4e9-5db4e5db539c">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d00d4ea5-cc7e-49b4-aee1-2b9dcd5bba5b">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="04d8bccf-b1b8-4b80-90f8-237db21561c0">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5864b314-aef0-40ae-b8e3-faa889958c20">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="828c2ee2-39cc-4e52-8806-c77bea7c88ed">
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2245ff91-75c5-4340-83ad-584ed5b43f47">
    <name>СуммаРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a637dc73-2177-491d-9779-0f30c63ae23c">
    <name>ДатаРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d170a938-f3af-4e0f-b749-f80b478b69e6">
    <name>ПлановаяДатаВнесения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b630b8db-c1e2-4bb7-88d1-e1f381585f1a">
    <name>АвторДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="58486805-baae-4c4a-a5f9-a384a59ae8e5">
    <name>ДатаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f787deb0-d4a1-4b9d-8bda-db7d1da4e649">
    <name>Кассир</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a646f9aa-1939-4296-b51d-9033cf585a32">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ba8943b-12c7-4299-86a3-5b1f6f988490">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18deb8ba-559e-49ef-b708-0e364c6b561e">
    <name>Контроль</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4397a01e-1867-478b-a7c0-d93166ae22d1">
    <name>ИтогоВнесено</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="59fd402b-122a-49d3-9dd9-4d65a589a525">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="97deaa98-b106-458a-9889-5a5b729a30f0">
    <name>ДокументыОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="54f6c4d0-31c2-440a-9822-08e1586eb534">
      <name>Документ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9382395f-d9d7-4e54-8c12-10c9571cbae2">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>12</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="498b2f25-6aa5-4645-9e67-8fb628c230a2">
    <name>ПолнаяИнформацияФНС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7bed3672-f007-4c00-b791-0b7ebd647c22">
    <name>ИнформацияФНС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="91d3583a-c05d-459c-9f83-fbfeb62fca07">
    <name>ДатаОбновленияДанныхФНС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9905e69a-09d1-4783-b0d4-a021c2f92565">
    <name>Выручка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>25</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3d17fbf5-4cee-45fc-8af7-13db85700ccc">
    <name>ПлательщикНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="df919cae-c1ba-4fe1-972e-d4222ab0005d">
    <name>КоличествоРаботников</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0800e2e-b103-41a7-a887-ca049af6677e">
    <name>НалоговыйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b5729a90-7b03-4912-9990-210602af51f1">
    <name>НаименованиеМеждународное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="2629d638-1c9b-4112-b68e-0560bb2d997b">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c62fe487-31b1-4ebb-b1a8-ad1821952696">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a9a6552a-9493-4353-953b-2f7c777b2f61">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="21ef8fb5-99ad-409e-9d21-398379db456f">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="72d876b9-29ff-4c5d-bb87-ac07cd9adf4b">
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9ee408c3-a4d4-4570-bc13-b6b4193f889a">
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="689cf9d5-3c38-4e84-8e8e-c5bad88bbac8">
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="48ac22c5-5bfb-458e-a816-f8ebffd836d8">
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7ceb314a-6d3d-4eb9-927d-ec92d5e2ffd3">
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="055bd074-c785-404d-a8d5-827b2754f483">
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7027a1ee-60c1-471c-aee1-a34bdb899465">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="366f1557-22c4-4832-947b-6020579affac">
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="09809d0f-5b0e-46d3-b7b7-24065f75b724">
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa7aa1c6-abc3-4421-b0ea-7d82a073d157">
      <name>ДействуетС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="07295009-77c8-4b40-8a9e-62debe0887c6">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f624df26-f68d-4892-b33d-cf2ef3cdaa0c">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="987ffccd-246d-49b8-a223-e53d76678887">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="861931ca-dadf-424e-9e87-cc6fec41bf47">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d3fe16d0-c615-4822-a095-1678933639d4">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Documents/КонтрольДенежныхСредств/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьЭлементов();
	Объект.АвторДокумента=Пользователи.ТекущийПользователь();
	УстановитьПараметрыВыбораДокументыДокумент();
КонецПроцедуры


&НаСервере
Процедура УстановитьДоступностьЭлементов()
	ТолькоМенеджер= (рольдоступна("ОтчетыМенеджераПоПродажам") и не рольдоступна("Кассир"));
	ТолькоКассир= рольдоступна("Кассир");
	если рольдоступна("Полныеправа") или рольдоступна("ОтчетыИОбработкиБухгалтера") тогда
		возврат;
	конецесли;	
	если Объект.Статус=Перечисления.СтатусыКонтроляДС.Закрыт тогда
		Толькоменеджер=истина;
		ТолькоКассир=Истина;
	конецесли;	
	
	Элементы.Партнер.ТолькоПросмотр=ТолькоМенеджер;
	Элементы.Контрагент.ТолькоПросмотр=ТолькоМенеджер;
	Элементы.Договор.ТолькоПросмотр=ТолькоМенеджер;
	Элементы.ДокументОснование.ТолькоПросмотр=ТолькоМенеджер;
	Элементы.Сотрудник.ТолькоПросмотр=ТолькоМенеджер;
	Элементы.ФормаОплаты.ТолькоПросмотр=ТолькоМенеджер;
	Элементы.СуммаРасчета.ТолькоПросмотр=ТолькоМенеджер;
	Элементы.ДатаРасчета.ТолькоПросмотр=ТолькоМенеджер;
	Элементы.ПлановаяДатаВнесения.ТолькоПросмотр=ТолькоМенеджер;
	
	Элементы.ДатаОплаты.ТолькоПросмотр=ТолькоКассир;
	Элементы.ДокументыОплаты.ТолькоПросмотр=ТолькоКассир;
	Элементы.Кассир.ТолькоПросмотр=ТолькоКассир;
	
	
КонецПроцедуры


&НаСервере
Функция СуммаДокументаОплаты(ДокументОплаты)

	 возврат ДокументОплаты.СуммаДокумента; 

КонецФункции 

&НаКлиенте
Процедура ДокументыДокументПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДокументыОплаты.ТекущиеДанные;
	ТекущаяСтрока.Сумма=СуммаДокументаОплаты(ТекущаяСтрока.Документ);
	РассчитатьКонтроль();
КонецПроцедуры
&НаСервере
Процедура РассчитатьКонтроль()

	Объект.Контроль=Объект.СуммаРасчета-Объект.ДокументыОплаты.Итог("Сумма");
	заполнитьзначениясвойств(Объект,РеквизитыОплаты());

КонецПроцедуры

&НаСервере
Функция РеквизитыОплаты()
    ДатаОплаты=дата('00010101');
	Кассир="";
	для каждого Док из Объект.ДокументыОплаты цикл
		если ДатаОплаты<Док.Документ.дата тогда
			ДатаОплаты=Док.Документ.Дата;
			ДокументОплаты=Док.Документ;
		конецесли;	
	конеццикла;
	если типзнч(ДокументОплаты)=тип("ДокументСсылка.ПриходныйКассовыйОрдер") тогда
		Кассир=ДокументОплаты.Кассир;
	иначеесли типзнч(ДокументОплаты)=тип("ДокументСсылка.ОперацияПоПлатежнойКарте") тогда 
		Кассир=ДокументОплаты.Ответственный;
	конецесли;	
	
	возврат Новый Структура("ДатаОплаты,Кассир",ДатаОплаты,Кассир);
	
КонецФункции


&НаКлиенте
Процедура ДокументыОплатыПослеУдаления(Элемент)
	  РассчитатьКонтроль();

КонецПроцедуры

&НаКлиенте
Процедура ДокументыОплатыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	РассчитатьКонтроль();
КонецПроцедуры

&НаКлиенте
Процедура СуммаРасчетаПриИзменении(Элемент)
	РассчитатьКонтроль();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
 	РассчитатьКонтроль();

	если Объект.Контроль=0 тогда
		Объект.Статус=предопределенноезначение("Перечисление.СтатусыКонтроляДС.Закрыт");
//	иначе
//		Объект.Статус=предопределенноезначение("Перечисление.СтатусыКонтроляДС.Создан");
	конецесли;	
	Отказ=не ПроверкаДублейДокументов();
    Объект.ИтогоВнесено=Объект.ДокументыОплаты.Итог("Сумма");
КонецПроцедуры

&НаСервере
Функция ПроверкаДублейДокументов()
	ТекстСообщения="";
	Результат=истина;
	ТаблицаДокументов=Объект.ДокументыОплаты.Выгрузить();
	для каждого стр из Объект.ДокументыОплаты цикл
		ПараметрыПоиска=новый Структура("Документ",стр.Документ);
		если ТаблицаДокументов.НайтиСтроки(ПараметрыПоиска).Количество()>1 тогда
			ТекстСообщения=ТекстСообщения+"Документ - "+стр.Документ+" уже присутствует в таблице"+символы.ПС;
			Результат=Ложь;
			прервать;
		конецесли;	
	конеццикла;	
	если не результат тогда
		Сообщить(ТекстСообщения);
	конецесли;	
	возврат Результат;
КонецФункции // ПроверкаДублейДокументов()

&НаСервере
Процедура УстановитьПараметрыВыбораДокументыДокумент()
	
	Элементы.ДокументыДокумент.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(Элементы.ДокументыДокумент, "Партнер", Объект.Партнер);

КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	//УстановитьПараметрыВыбораДокументыДокумент();
КонецПроцедуры

#Область СобытияФормы
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда  
		Партнер = АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "Партнер");
		Если ЗначениеЗаполнено(Партнер) Тогда
			Объект.Партнер = Партнер; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицо(Команда)
	Объект.Контрагент = ФизЛицоСервер(); 
КонецПроцедуры

&НаСервере
Функция ФизЛицоСервер()
	Возврат Справочники.Контрагенты.НайтиПоНаименованию("ФИЗИЧЕСКОЕ ЛИЦО"); 
КонецФункции

#КонецОбласти
